[
    {
        "text": "I know I’ve been missing for a while.\nLife threw a double punch - COVID and typhoid - and trust me, it wasn’t easy.\n\nA few days in the hospital, followed by weeks of slow recovery - physically, mentally, emotionally.\n\nSometimes, you don’t just need rest.\nYou need to pause.\n\nHealth issues aside, life hasn’t been easy lately.\nChallenges - some expected, most not - came in waves.\n\nAnd no matter how strong you are, there are moments where everything feels just… too much.\n\nBreathe.\nAnd be kind to yourself.\n\nThat’s exactly what I’ve been doing.\nI took a break. Logged off. Focused on healing.\n\nAnd now, step by step - I’m finding my way back.\nNot rushing. Just rebuilding - slowly and mindfully.\n\nTo everyone who checked in: thank you.\nTo everyone else navigating tough times: I see you. Take your time. Healing isn’t a race.\n\nI’m recovering.\nSlowly. Gently. One day at a time.\n\nTrying to find my rhythm again - without burning myself out.\n\nIf you’re going through something right now - whether it’s physical, mental, emotional -\n\nPlease know: it’s okay to pause.\n - It’s okay to fall behind.\n - It’s okay to not be okay.\n\nYou owe no one an explanation for choosing your peace.\nI’m still in that space - of reflection, realignment, and rebuilding.\n\nI’m coming back - one little step at a time.",
        "engagement": 123,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Mental Health"
        ]
    },
    {
        "text": "Some of the smartest people I know are jobless right now.\n\nNot because they’re lazy.\nNot because they don’t have skills.\nBut because the system is broken.\n\n– Companies post fake jobs.\n– They reopen the same roles every month.\n– Candidates solve 5-hour assignments and get ghosted.\n– Referrals go nowhere.\n– Rejections come in 2 minutes.\n– Or never.\n\nAnd yet we still say: *'Keep applying. Your time will come.'*\n\nMaybe.\nBut maybe the problem isn't us.\nMaybe it’s the way hiring works — with no empathy, no accountability, no respect.\n\nIf you’re tired, frustrated, burnt out — you’re not alone.\nYou’re not a failure. You’re just stuck in a system that was never built to be kind.\n\nAnd I’m done pretending that’s normal.",
        "engagement": 98,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Job Search"
        ]
    },
    {
        "text": "Unpopular opinion:\n\nThe job market isn’t about talent anymore.\nIt’s about timing, luck, and how loud you can scream on LinkedIn.\n\nSome of the smartest people I know are unemployed.\nSome of the most average ones are getting promoted.\n\nWhy?\nBecause this game isn’t fair.\nIt never was.\n\nWe don’t reward loyalty.\nWe reward performative work.\nWe don’t hire for skill.\nWe hire who sounds skilled.\n\nSo if you're tired, bitter, or confused - you're not broken.\nYou're just awake.\n\nAwake enough to realize that sometimes…\nyou can do everything right and still be left behind.\n\nThis post is for the ones who aren’t clapping right now -\nbecause they’re still stuck in a loop.\n\nYou’re not invisible.\nYou’re just not loud yet.",
        "engagement": 234,
        "line_count": 14,
        "language": "English",
        "tags": [
            "Job Market",
            "Career Development"
        ]
    },
    {
        "text": "No one talks about silent layoffs.\n\nBecause there's no email.\nNo public announcement.\nNo 'we’re downsizing.'\n\nJust:\n\nFewer projects assigned to you\n\nFewer replies to your messages\n\nImportant meetings suddenly not including you\n\nSlowly being made to feel… invisible\n\nUntil one day, you realize -\nThey’re not firing you.\nThey’re pushing you to quit.\n\nIt’s not written in any HR policy.\nBut it happens. Quietly. Brutally. Strategically.\n\nYou start doubting yourself.\nYou think maybe it’s my fault.\nYou start working harder—until burnout becomes your new normal.\n\nLet me say this loud:\nIt was never your fault.\n\nCompanies don’t always cut costs by cutting heads.\nSometimes, they just cut your purpose.\n\nAnd if this happened to you -\nYou didn’t 'fail.'\nYou survived something no one warns you about.\n\nLet’s talk about it.\nLet’s make it visible.\nBecause staying silent only protects the ones doing it.",
        "engagement": 847,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Job Market",
            "Career Development"
        ]
    },
    {
        "text": "The world doesn’t need more billionaires.\nIt needs more kind people.\n\nBe the one who says 'thank you' -\nTo the delivery partner who’s drenched in rain,\nYet hands you your parcel with a smile.\n\nBe the one who holds the door -\nEven if you're running late.\nKindness doesn’t check the time.\n\nBe the one who waves at the cleaner in your office.\nThey pick up after you.\nAnd no one ever says their name.\n\nText your friend who’s gone quiet.\nNot to ask why.\nJust to say: 'I’m here. No pressure to reply.'\n\nCompliment someone’s handwriting.\nSomeone’s sweater.\nSomeone’s presentation.\nYou never know how long they waited to hear something nice.\n\nAsk your cab driver if he’s eaten.\nNot out of sympathy.\nOut of humanity.\n\nTalk to the little kid in your building’s lift.\nHe’ll tell you how many stars are in his drawing.\nAnd you’ll forget how heavy your day was.\n\nSay 'I’m proud of you' to your younger sibling.\nThey look strong. But they still crave your validation.\n\nPay for the tea of the guy standing behind you in line.\nNo photo. No reel. No caption.\nJust pay. And walk away.\n\nSay sorry first.\nEven if your ego throws a tantrum.\nLove > winning.\n\nCall your grandparents.\nThey don't want much -\nJust your voice and five minutes of your day.\n\nTell your teacher from school:\n'’Ma’am, I still remember what you taught me.''\nIt might make her whole month.\n\nWe spend so much time trying to be liked.\nTry being loving.\nTry being light.\n\nBecause in the end,\nNo one will remember your salary.\nThey'll remember how you made them feel.\n\nSo go be the reason someone believes\nthe world still has good people.\n\nThat’s real success.\nThat’s real impact.\nThat’s what truly goes viral - in hearts.",
        "engagement": 231,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Motivation",
            "Kindness"
        ]
    },
    {
        "text": "Yesterday one of my closest friends asked -\n\n'Why do good people suffer a lot?'\n\nThe question is -\n\nDo good people suffer more?\n\nYes.\nBecause they care more.\nBecause they expect less.\nBecause they give without calculating.\nBecause they believe people will treat them the same way they do.\n\nAnd that’s where it hurts.\n\nThey get taken for granted.\nUsed.\nIgnored.\nAnd then blamed for 'not having boundaries.'\n\nPeople say, 'Just be strong.'\nBut no one asks why they had to be strong in the first place.\n\nBeing a good person in today’s world often feels like a punishment.\n\nYou help people when they’re at their lowest.\nBut when you’re at your lowest?\nYou’ll be lucky if even one person checks in.\n\nThey keep forgiving.\nKeep helping.\nKeep smiling - while silently breaking inside.\nBecause they think being good is more important than being right.\n\nBut here's what no one tells you:\n\nBeing good doesn't mean you're weak.\nIt means you're strong enough to not become like the ones who hurt you.\n\nIt’s easy to become bitter.\nHard to remain kind.\n\nSo if you're someone who still chooses goodness in a world that doesn't always return it...\nYou are rare.\nYou are gold.\nYou are not alone.\n\nAnd one day, your goodness will come back to you -\nNot from the people you gave it to,\nBut from the universe itself.\n\nStay kind. Even if it hurts.\n\nGood people don’t suffer because they’re weak.\nThey suffer because they keep showing up - even when the world doesn’t deserve them.\n\nIf you're one of them:\nPlease don’t change.\nJust learn to protect your peace.\nSay no without guilt.\nTake breaks without explaining.\nAnd stop setting yourself on fire to keep others warm.\n\nBeing good is not your problem.\nNot knowing when to stop - is.\n\nThe world needs more people like you.",
        "engagement": 436,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Not a movie.\nNot a scene from 'Gunjan Saxena'.\nThis happened for real.\n\nWhile the whole nation was asking -\n'What’s India’s response to the terror attack?'\nIt wasn’t a man in uniform who stood at the front.\nIt was Wing Commander Vyomika Singh.\n\nIn front of flashing cameras, military maps, and the eyes of the world -\nShe calmly briefed the nation about Operation Sindoor:\nIndia’s precise strikes on terror bases in PoK and Pakistan.\n\nNo panic.\nNo chest-thumping.\nJust clarity, confidence, and class.\n\nShe’s not just a pilot.\nShe has clocked over 2,500 flying hours in the toughest zones -\nFrom Siachen to Arunachal.\n\nShe’s led evacuations, missions, and now, the nation's official military briefing.\n\nWhile some still debate 'Can women handle pressure?'\nVyomika Singh answered with silence.\nHer uniform did the talking.\nHer presence did the proving.\n\nHistory will remember this moment.\nNot just for the operation -\nBut for the woman who stood tall and led from the front.\n\nTake a bow, ma’am.\nYou didn’t just strike terror camps.\nYou struck down stereotypes.",
        "engagement": 353,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Women Empowerment",
            "India"
        ]
    },
    {
        "text": "STOP GLORIFYING DRAMA IN THE NAME OF NEWS.\n\nIt's high time we, as citizens of India, take responsibility for the kind of news we consume.\n\nSome news channels today have turned journalism into a circus:\n\nFake news for TRP.\n\nWar coverage like it's a cricket match.\n\nSirens, shouting, and chaos in the studio.\n\nMisrepresenting facts that insult our armed forces and damage national interest.\n\nAnd the worst part?\nEvery view you give them = more money from ads = more noise tomorrow.\n\nBut there is a solution.\n\nWatch DD News.\nWhy?\n\nIt's the only channel directly operated by the Government of India.\n\nIt sticks to facts, official sources, and press releases.\n\nNo shouting. No sensationalism. No TRP race.\n\nWe don’t need drama. We need truth.\nWe don’t need shouting. We need clarity.\nWe don’t need fake debates. We need facts.\n\n🇮🇳 Support real journalism.\n🇮🇳 Boycott noise.\n🇮🇳 Jai Hind.",
        "engagement": 78,
        "line_count": 17,
        "language": "English",
        "tags": [
            "News"
        ]
    },
    {
        "text": "The name - Sindoor is perfect!\n\nNamed after the red sindoor that graces the forehead of a married Hindu woman.\n\nBut after the Pahalgam terror attack, that sindoor turned into a streak of blood.\n\nBecause on April 22, in the Pahalgam terror attack,\nthat sindoor was wiped away from the foreheads of 26 women.\n\nTheir husbands were murdered - not in battle, but on a peaceful trip.\n\nAnd so, India responded.\n\nNot with words. Not with warnings. But with justice.\n\nIn just 23 minutes, India's Operation Sindoor struck at the heart of terror -\n\nacross Pakistan and PoK - where those monsters were hiding.\n\nThis wasn’t revenge.\nThis was a message.\n\nThis wasn’t just a military strike.\n\nIt was a tribute to the broken bangles, the fading vermilion, and the mothers who couldn’t explain to their children why papa wasn’t coming back.\n\nTouch our people, and we’ll cross mountains, borders, and skies to bring justice.\n\nThis sindoor will not fade in fear.\n\nIt will burn in rage.\n\nAnd it will stand for every woman who lost her world that day.\n\nIndia doesn’t forget. India doesn’t forgive.\n\nTouch our people, and we will rewrite maps.\nBreak our homes, and we will break your safehouses.\n\nThis sindoor will no longer be wiped away in tears.\n\nIt will be protected by steel, sky, and spine.\n\nIndia may forgive, but it will never forget.\n\nAnd when it strikes back - the world watches.\n\nJai Hind. Bharat Mata ki Jai.",
        "engagement": 90,
        "line_count": 26,
        "language": "English",
        "tags": [
            "India"
        ]
    },
    {
        "text": "You won’t believe what happened when I taught a chaiwala SQL.\nI gave him a free YouTube playlist.\nHe finished it in 15 days.\n\nThen built a dashboard for his tea stall.\nNow he tracks peak hours, top-selling items, and even tips.\n\nHe doesn’t have a degree.\nHe has discipline.\n\nDegrees help.\nBut curiosity? It changes lives.\n\nNever underestimate the power of free resources - and the will to learn.\nNever underestimate me, I can write good fictional stories.",
        "engagement": 352,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Technology",
            "Learning"
        ]
    },
    {
        "text": "After I wrote 'Interested' under 100+ posts today but didn't get the job.\n\nI will keep commenting 'Interested' under every single job post.\nEven if:\n\nThe job requires 20 years of experience and I'm 18.\n\nThe recruiter hasn’t replied since Independence Day\n\nThe post is from 2021\n\nThe company doesn’t exist anymore\n\nI will still comment 'Interested.'\n\nWhy?\nBecause that's who I am now.\nI don't apply for jobs anymore.\nI manifest them…\n…with one powerful word: Interested.\n\nThey ghost me? I comment.\nThey scam me? I comment.\nThey post fake roles to increase engagement?\nOh you already know I’m commenting.\n\nBy 2030, I’ll be on my deathbed whispering:\n'Interested.'\n\nBecause dreams die, but LinkedIn comments live forever.",
        "engagement": 632,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Job Search",
            "Humor"
        ]
    },
    {
        "text": "Position: Human Robot\nLocation: Anywhere, as long as you're always online\nSalary: Emotional damage + pizza on Fridays\n\nWe are hiring!\nLooking for someone who:\n\nHas 10+ years of experience (even if you're 23)\n\nCan work 14 hours a day but say 'I love the hustle'\n\nDoesn’t ask for leaves, weekends, or peace\n\nKnows every tool on earth (even the ones not invented yet)\n\nCan attend 5 meetings simultaneously without blinking\n\nWill smile even when given feedback like 'be less you'\n\nPerks:\n\nExposure (not salary)\n\nFree mental breakdowns\n\nA chair\n\nOccasional thank yous (on Slack, not in person)\n\nBonus if:\n\nYou say 'yes' before reading the job description\n\nYou can gaslight yourself into thinking you're happy.\n\nTo apply:\nSend your soul.\nOr just type 'Interested' in the comments like everyone else.",
        "engagement": 145,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Job Search",
            "Humor"
        ]
    },
    {
        "text": "A good manager doesn’t just manage your work. \nThey protect your sanity.\n\nThey guide you, support you, and get the best out of you - without making you feel like trash.\n\nBut a bad manager? \nThey make you question your worth every single day.\n\nAccording to a *Gallup study*, 70% of the variance in team engagement is directly linked to the *manager*. \n\nAnother survey shows *65% of employees would take a new boss over a pay raise*.\n\nPeople don’t leave jobs. \nThey leave toxic managers. \nAnd no amount of free coffee or flexible hours can fix that.\n\nIf you're a manager, ask yourself honestly: \n*Would *you* want to report to you?*\n\nThanks Qaim Abbas for being a wonderful one! The best one till now! \n\nThese last 2 months flew by!\n\nThanks for making me feel safe, helping me grow and make the work feel more meaningful!",
        "engagement": 35,
        "line_count": 14,
        "language": "English",
        "tags": [
            "Leadership"
        ]
    },
    {
        "text": "There are some influencers who'll shamelessly post all day about Crosscoder, Hey poach all day and I even saw some of them posting yesterday and today.\n\nI have been asked to promote many times, getting 4k-5k for posting a copy-pasted post, I do colab with teams that I find useful and can be great for people.\n\nBut\n\nHave you noticed many of them being silent on what happened in Kashmir? Some of them posted about it but the majority haven't.\n\nYou know why?\n\nBecause speaking up doesn’t pay.\n\nThere’s no brand deal. No affiliate code. No likes from corporate recruiters. No “collaboration opportunity.”\n\nJust a simple truth: If it's not profitable, it’s not worth talking about.\n\nInfluencing has become a business, not a responsibility. And when real issues happen -issues that affect people, that deserve voices they go quiet.\n\nBecause silence is safer.\n\nBecause this issue won’t get them engagement - it could cost them everything.\n\n– They might lose followers\n– Upset brands\n– Offend recruiters\n– Be labelled “controversial”\n– Lose out on collabs and visibility\n\nThis post might not get me likes or money. But if even one person starts questioning the silence of people they follow, it’s worth it.\n\nAnd if the people with thousands of followers, with platforms, with reach… choose not to speak - then what are they even influencing?\n\nBeing an influencer doesn’t mean being brand-friendly.\n\nIt means having the guts to stand up, even when it’s uncomfortable.\n\nEven when it hurts your reach, followers. Even when it affects your paycheck.\n\nUse your voice for more than brand deals.\n\nOr stop calling yourself an influencer.\n\nSo the next time you see someone flexing their 'personal brand' and hashtag#InfluencerLife, ask them one question:\n\nWhat do you stand for when no one’s watching?\n\nHere's one person posting an offer letter that looks like it's made on the word with an affiliate link and I'll leave it up to you now, decide who you want to support!\n\ntagging Ramesh Kumar because he's doing some exceptional work in this!",
        "engagement": 46,
        "line_count": 26,
        "language": "English",
        "tags": [
            "Social Media"
        ]
    }
]